{"weightsManifest": [{"paths": ["group1-shard1of17.bin", "group1-shard2of17.bin", "group1-shard3of17.bin", "group1-shard4of17.bin", "group1-shard5of17.bin", "group1-shard6of17.bin", "group1-shard7of17.bin", "group1-shard8of17.bin", "group1-shard9of17.bin", "group1-shard10of17.bin", "group1-shard11of17.bin", "group1-shard12of17.bin", "group1-shard13of17.bin", "group1-shard14of17.bin", "group1-shard15of17.bin", "group1-shard16of17.bin", "group1-shard17of17.bin"], "weights": [{"dtype": "float32", "shape": [8, 100, 32], "name": "CNN/kernel"}, {"dtype": "float32", "shape": [32], "name": "CNN/bias"}, {"dtype": "float32", "shape": [15676, 100], "name": "Char_Embedding/embeddings"}, {"dtype": "float32", "shape": [17472, 10], "name": "Dense/kernel"}, {"dtype": "float32", "shape": [10], "name": "Dense/bias"}, {"dtype": "float32", "shape": [10, 1], "name": "Output/kernel"}, {"dtype": "float32", "shape": [1], "name": "Output/bias"}, {"dtype": "float32", "shape": [156751, 100], "name": "Word_Embedding/embeddings"}]}], "modelTopology": {"training_config": {"metrics": [[{"class_name": "TruePositives", "config": {"dtype": "float32", "thresholds": null, "name": "tp"}}, {"class_name": "FalsePositives", "config": {"dtype": "float32", "thresholds": null, "name": "fp"}}, {"class_name": "TrueNegatives", "config": {"dtype": "float32", "thresholds": null, "name": "tn"}}, {"class_name": "FalseNegatives", "config": {"dtype": "float32", "thresholds": null, "name": "fn"}}, {"class_name": "BinaryAccuracy", "config": {"threshold": 0.5, "dtype": "float32", "name": "accuracy"}}, {"class_name": "Precision", "config": {"top_k": null, "dtype": "float32", "thresholds": null, "name": "precision", "class_id": null}}, {"class_name": "Recall", "config": {"top_k": null, "dtype": "float32", "thresholds": null, "name": "recall", "class_id": null}}, {"class_name": "AUC", "config": {"label_weights": null, "name": "auc", "dtype": "float32", "thresholds": [0.005025125628140704, 0.010050251256281407, 0.01507537688442211, 0.020100502512562814, 0.02512562814070352, 0.03015075376884422, 0.035175879396984924, 0.04020100502512563, 0.04522613065326633, 0.05025125628140704, 0.05527638190954774, 0.06030150753768844, 0.06532663316582915, 0.07035175879396985, 0.07537688442211055, 0.08040201005025126, 0.08542713567839195, 0.09045226130653267, 0.09547738693467336, 0.10050251256281408, 0.10552763819095477, 0.11055276381909548, 0.11557788944723618, 0.12060301507537688, 0.12562814070351758, 0.1306532663316583, 0.135678391959799, 0.1407035175879397, 0.1457286432160804, 0.1507537688442211, 0.15577889447236182, 0.16080402010050251, 0.1658291457286432, 0.1708542713567839, 0.17587939698492464, 0.18090452261306533, 0.18592964824120603, 0.19095477386934673, 0.19597989949748743, 0.20100502512562815, 0.20603015075376885, 0.21105527638190955, 0.21608040201005024, 0.22110552763819097, 0.22613065326633167, 0.23115577889447236, 0.23618090452261306, 0.24120603015075376, 0.24623115577889448, 0.25125628140703515, 0.2562814070351759, 0.2613065326633166, 0.2663316582914573, 0.271356783919598, 0.27638190954773867, 0.2814070351758794, 0.2864321608040201, 0.2914572864321608, 0.2964824120603015, 0.3015075376884422, 0.3065326633165829, 0.31155778894472363, 0.3165829145728643, 0.32160804020100503, 0.32663316582914576, 0.3316582914572864, 0.33668341708542715, 0.3417085427135678, 0.34673366834170855, 0.35175879396984927, 0.35678391959798994, 0.36180904522613067, 0.36683417085427134, 0.37185929648241206, 0.3768844221105528, 0.38190954773869346, 0.3869346733668342, 0.39195979899497485, 0.3969849246231156, 0.4020100502512563, 0.40703517587939697, 0.4120603015075377, 0.41708542713567837, 0.4221105527638191, 0.4271356783919598, 0.4321608040201005, 0.4371859296482412, 0.44221105527638194, 0.4472361809045226, 0.45226130653266333, 0.457286432160804, 0.4623115577889447, 0.46733668341708545, 0.4723618090452261, 0.47738693467336685, 0.4824120603015075, 0.48743718592964824, 0.49246231155778897, 0.49748743718592964, 0.5025125628140703, 0.507537688442211, 0.5125628140703518, 0.5175879396984925, 0.5226130653266332, 0.5276381909547738, 0.5326633165829145, 0.5376884422110553, 0.542713567839196, 0.5477386934673367, 0.5527638190954773, 0.5577889447236181, 0.5628140703517588, 0.5678391959798995, 0.5728643216080402, 0.5778894472361809, 0.5829145728643216, 0.5879396984924623, 0.592964824120603, 0.5979899497487438, 0.6030150753768844, 0.6080402010050251, 0.6130653266331658, 0.6180904522613065, 0.6231155778894473, 0.628140703517588, 0.6331658291457286, 0.6381909547738693, 0.6432160804020101, 0.6482412060301508, 0.6532663316582915, 0.6582914572864321, 0.6633165829145728, 0.6683417085427136, 0.6733668341708543, 0.678391959798995, 0.6834170854271356, 0.6884422110552764, 0.6934673366834171, 0.6984924623115578, 0.7035175879396985, 0.7085427135678392, 0.7135678391959799, 0.7185929648241206, 0.7236180904522613, 0.7286432160804021, 0.7336683417085427, 0.7386934673366834, 0.7437185929648241, 0.7487437185929648, 0.7537688442211056, 0.7587939698492462, 0.7638190954773869, 0.7688442211055276, 0.7738693467336684, 0.7788944723618091, 0.7839195979899497, 0.7889447236180904, 0.7939698492462312, 0.7989949748743719, 0.8040201005025126, 0.8090452261306532, 0.8140703517587939, 0.8190954773869347, 0.8241206030150754, 0.8291457286432161, 0.8341708542713567, 0.8391959798994975, 0.8442211055276382, 0.8492462311557789, 0.8542713567839196, 0.8592964824120602, 0.864321608040201, 0.8693467336683417, 0.8743718592964824, 0.8793969849246231, 0.8844221105527639, 0.8894472361809045, 0.8944723618090452, 0.8994974874371859, 0.9045226130653267, 0.9095477386934674, 0.914572864321608, 0.9195979899497487, 0.9246231155778895, 0.9296482412060302, 0.9346733668341709, 0.9396984924623115, 0.9447236180904522, 0.949748743718593, 0.9547738693467337, 0.9597989949748744, 0.964824120603015, 0.9698492462311558, 0.9748743718592965, 0.9798994974874372, 0.9849246231155779, 0.9899497487437185, 0.9949748743718593], "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "num_thresholds": 200}}]], "loss": "binary_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "loss_weights": null}, "keras_version": "2.4.0", "model_config": {"class_name": "Functional", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "int32", "batch_input_shape": [null, 1000], "name": "Char_Input", "sparse": false}, "name": "Char_Input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "int32", "batch_input_shape": [null, 100], "name": "Word_Input", "sparse": false}, "name": "Word_Input"}, {"class_name": "Embedding", "inbound_nodes": [[["Char_Input", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "Char_Embedding", "dtype": "float32", "output_dim": 100, "trainable": true, "embeddings_regularizer": null, "input_dim": 15676, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1000], "activity_regularizer": null, "input_length": 1000}, "name": "Char_Embedding"}, {"class_name": "Embedding", "inbound_nodes": [[["Word_Input", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "Word_Embedding", "dtype": "float32", "output_dim": 100, "trainable": true, "embeddings_regularizer": null, "input_dim": 156751, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 100], "activity_regularizer": null, "input_length": 100}, "name": "Word_Embedding"}, {"class_name": "Concatenate", "inbound_nodes": [[["Char_Embedding", 0, 0, {}], ["Word_Embedding", 0, 0, {}]]], "config": {"dtype": "int64", "trainable": true, "name": "Concatenation", "axis": 1}, "name": "Concatenation"}, {"class_name": "Conv1D", "inbound_nodes": [[["Concatenation", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "CNN", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [8]}, "name": "CNN"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["CNN", 0, 0, {}]]], "config": {"name": "Pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2], "padding": "valid", "strides": [2]}, "name": "Pool"}, {"class_name": "Flatten", "inbound_nodes": [[["Pool", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "Flat", "data_format": "channels_last"}, "name": "Flat"}, {"class_name": "Dense", "inbound_nodes": [[["Flat", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "Dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "name": "Dense"}, {"class_name": "Dropout", "inbound_nodes": [[["Dense", 0, 0, {}]]], "config": {"name": "Dropout", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}, "name": "Dropout"}, {"class_name": "Dense", "inbound_nodes": [[["Dropout", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "Output", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "name": "Output"}], "output_layers": [["Output", 0, 0]], "name": "Model", "input_layers": [["Char_Input", 0, 0], ["Word_Input", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.3.0", "format": "layers-model"}